{
    "blog": 
        [
            {
                "id": 4,
                "title": "Título del post numero 4",
                "date": "28-12-2022",
                "paragraphs": 
                    [
                        "Parrafo numero 1 para colocar lo que quieras poner, esto puede seguir y seguir y seguir y seguir.",
                        "Párrafo número 2 para colocar otra idea mas desarrollada en profundidad.",
                        "Y acá otro párrafo más, para seguir ahondando en la problemática y llegar al meollo de la cuestión.",
                        "En este otro párrafo se puede comenzar a dar luz sobre el asunto.",
                        "Y en este otro párrafo se puede desatar el nudo generado en el medio.",
                        "Acá puede haber un desenlace y alguna resolución o consejo, o data puntual."
                    ]     
            },
            {
                "id": 3,
                "title": "Título del post numero 3",
                "date": "05-12-2022",
                "paragraphs": 
                    [
                        "Parrafo numero 1 para colocar lo que quieras poner, esto puede seguir y seguir y seguir y seguir.",
                        "Párrafo número 2 para colocar otra idea mas desarrollada en profundidad.",
                        "Y acá otro párrafo más, para seguir ahondando en la problemática y llegar al meollo de la cuestión.",
                        "En este otro párrafo se puede comenzar a dar luz sobre el asunto.",
                        "Y en este otro párrafo se puede desatar el nudo generado en el medio.",
                        "Acá puede haber un desenlace y alguna resolución o consejo, o data puntual."
                    ]     
            },
            {
                "id": 2,
                "title": "Título del post numero 2",
                "date": "30-06-2022",
                "paragraphs": 
                    [
                        "ID: 2. Parrafo numero 1 para colocar lo que quieras poner, esto puede seguir y seguir y seguir y seguir."
                        
                        
                        
                    ]     
            },
            {
                "id": 1,
                "title": "Aprender es desafiarse a superar la frustración",
                "date": "27-12-2022",
                "paragraphs": 
                    [
                        "Algo que me está sucediendo mucho al ser programador es pasar el ciclo de aprendizaje de forma mucho más periódica. Pongo contexto, antes de decidir meterme en el mundo developer estaba haciendo la carrera de Diseño Industrial, y como en todo estudio académico hay un plan de estudios donde los procesos de aprendizaje son más amplios y también con un ritmo más lento, esto no es que esté bien o mal, simplemente es así, en una carrera para formar a un profesional es necesario abarcar muchos temas y eso lleva tiempo. En cambio, al entrar en el desarrollo Front End empecé a aprender un primer lenguaje (HTML) y luego otro (CSS), poniéndolos en práctica casi al unísono para empezar a maquetar unas primeras páginas de aprendizaje, y al poco tiempo ya aprendiendo un lenguaje de programación (JavaScript) para hacer desarrollos más dinámicos y modernos, y después otra herramienta, y así constantemente mejorando.",
                        "Todo ciclo de aprendizaje (sea del tema que sea) tiene etapas, y una muy importante es la frustración, puede que la superes fácil, que te resulte difícil o que no la superes en absoluto y desistas, pero la frustración siempre está presente en el aprendizaje, porque aprender es hacer propio algo que desconocemos, algo que no entendemos en su totalidad pero que deseamos comprender y dominar, y cuando no podemos entenderlo eso nos puede frustrar, pero la diferencia radica absolutamente en una sola cosa, la actitud, el deseo interno de sobreponerse, superarlo y buscar la forma de aprender eso que se desea.",
                        "Aprender es desafiarse a uno mismo a lograr superar esa frustración, el aprendizaje se encuentra del otro lado del muro de la frustración, el aprendizaje es la iluminación de tu corteza cerebral cuando hizo todas las conexiones necesarias para que puedas decir “Eureka!!!”. En este ámbito de la programación es muy común la necesidad de ser habidos en aprender nuevas tecnologías y herramientas, todo avanza, todo evoluciona y se transforma, y por esto estamos en constante proceso en el ciclo de aprendizaje y superando la frustración que cada vez se hace más fácil de superar, es como un entrenamiento.",
                        "En mi caso lo que me motiva fuertemente por aprender una nueva herramienta son las habilidades que luego voy a poder volcar en pos de mejorar mi desarrollo, en mejorar la calidad de lo que hago para una persona que va a usar ese producto final y que tenga una mejor experiencia de usuario. Esa motivación me lleva a seguir enfrentando ese muro de frustración, haciéndolo cada vez más pequeño y más fácil de superar, es el desafío constante de empujar los límites del conocimiento.",
                        "Es normal frustrarse, chocarse con una pared y ver cómo son las cosas realmente, pero lo importante no pasa por ahí, lo importante es lograr superar ese momento y avanzar.",
                        "Por eso si estás pensando en desistir, no lo decidas aún, tomate un respiro, cambiá el aire, dale un descanso a tu cabeza haciendo una actividad totalmente distinta, tomá distancia del problema, y luego volvé, y pensá en CÓMO PODÉS SUPERARLO. Con el tiempo te va a ir resultando más fácil."
                    ]     
            }
            
        
        ]        
}